{
  "image_category": {
    "sfw": [
      {"name": "fashion editorial", "description": "High-end magazine-style fashion image with strong styling, deliberate pose, and art-directed lighting and composition. Think bold wardrobe, curated set design, and a cohesive visual story."},
      {"name": "beauty close-up", "description": "Tight portrait focused on face and makeup details (skin texture, eyes, lips), usually with clean backgrounds and controlled light. Emphasize cosmetics, hairline detail, and flattering angles."},
      {"name": "studio lookbook", "description": "Catalog-like studio series showcasing outfits clearly. Clean studio backdrop, even lighting, and readable full/three-quarter body framing so clothing is easy to see."},
      {"name": "catalog photo", "description": "Product-forward fashion photo where the outfit is the hero. Simple background, neutral pose, sharp focus, minimal storytelling; optimize clarity and garment readability."},
      {"name": "runway fashion", "description": "Catwalk presentation with confident stride and stage lighting. Emphasize runway environment, audience blur, dramatic spotlights, and couture garment movement."},
      {"name": "street fashion", "description": "Candid-yet-styled fashion in real urban locations. Natural light, city textures, lifestyle energy, and outfit as part of the environment."},
      {"name": "cinematic still", "description": "A single film-frame moment with narrative tension. Use cinematic lighting, depth, camera framing, and a clear story beat; avoid looking like a posed studio shot."},
      {"name": "golden hour portrait", "description": "Warm, low-angle sunset light with soft flare and gentle contrast. Emphasize glowing rim light, long shadows, and a natural outdoor feel."},
      {"name": "low key portrait", "description": "Moody portrait with deep shadows and controlled highlights. Use dramatic contrast, selective illumination, and a darker background for intensity."},
      {"name": "concept art", "description": "Design-focused illustration that communicates a character idea clearly. Use readable silhouettes, material callouts, and worldbuilding hints; can be painterly or sketchy but must feel designed."},
      {"name": "fantasy illustration", "description": "Illustrated fantasy scene/character with magical elements, ornate materials, and mythic atmosphere. Use stylized lighting and storybook or epic fantasy cues."},
      {"name": "sci-fi illustration", "description": "Illustrated futuristic aesthetic: advanced materials, tech details, neon or industrial lighting, and sci-fi props/architecture. Prioritize believable tech design language."},
      {"name": "digital painting", "description": "Painterly artwork with visible brushwork/painted rendering rather than photographic realism. Emphasize stylization, color harmony, and artistic texture."},
      {"name": "anime style", "description": "Stylized 2D anime illustration: simplified facial features, clean linework, flat-to-cel shading, and expressive eyes. Avoid describing camera gear or photographic realism."},
      {"name": "semi-real anime", "description": "Anime-inspired character with more realistic proportions and rendering. Softer shading, more detailed materials, but still clearly illustrated (not a photo)."},
      {"name": "vtuber model", "description": "A stylized streamer-avatar character design (often anime-inspired) with polished, clean rendering. Emphasize character readability, signature outfit, and a modern online persona vibe."},
      {"name": "3D character render", "description": "A CGI/3D-rendered character with physically plausible materials, studio or scene lighting, and a rendered look. Mention subsurface scattering, glossy fabric, or game/film-quality rendering cues."},
      {"name": "game character art", "description": "Character key art suitable for a game: dynamic pose, clear silhouette, gear details, and thematic world cues. Often high-contrast, dramatic lighting, and action-ready styling."},
      {"name": "oil painting portrait", "description": "Traditional oil portrait look with layered paint texture, rich pigments, and classical lighting. Mention canvas texture, brushwork, and painterly edges."},
      {"name": "watercolor portrait", "description": "Watercolor illustration with soft blooms, transparent washes, and paper grain. Use gentle edges, light color layering, and a delicate handmade feel."},
      {"name": "art nouveau poster", "description": "Decorative poster style with flowing organic lines, ornate borders, and elegant typography-like framing (but do not include actual text). Emphasize floral motifs and flat-yet-detailed color blocks."},
      {"name": "pop art style", "description": "Bold graphic look with high-contrast colors, halftone dots, thick outlines, and comic-inspired shapes. Emphasize punchy palettes and poster-like simplicity."},
      {"name": "cyberpunk artwork", "description": "Neon-drenched futuristic urban vibe with high contrast, rain reflections, holograms, and dense signage-like ambience (without real brand text). Emphasize techwear, chrome, and moody atmosphere."},
      {"name": "glamour photo", "description": "Stylized beauty/fashion portrait emphasizing elegance, polish, and flattering lighting. Think magazine glamour: smooth light, confident pose, refined styling, and a luxurious vibe (SFW)."},
      {"name": "high fashion editorial", "description": "Avant-garde fashion imagery with daring styling, striking poses, and art-directed composition. Emphasize couture details, dramatic lighting, and an intentional, editorial mood."},
      {"name": "waifu", "description": "Anime-style character art designed to be charming and appealing in a cute/romantic way. Emphasize expressive eyes, clean linework, and wholesome, SFW character design."},
      {"name": "kemonomimi", "description": "Anime-style character with animal ears (e.g., cat/fox/bunny) as a design element. Emphasize cute stylization, ear/ tail details if present, and a cohesive fantasy-anime aesthetic."},
      {"name": "ai influencer", "description": "Photoreal or stylized social-media persona image with polished styling and contemporary trends. Emphasize modern makeup, trendy outfit, and a confident “online creator” vibe."},
      {"name": "instagram aesthetic", "description": "Highly curated lifestyle/fashion image with cohesive color grading and composition. Emphasize clean backgrounds, pleasing symmetry, and trendy styling."},
      {"name": "tiktok content", "description": "Modern short-form creator vibe: energetic pose, casual setup, bold styling, and attention-grabbing framing. Emphasize contemporary youth culture styling while keeping it adult and SFW."},
      {"name": "pinterest mood board", "description": "A cohesive, curated aesthetic collage feel translated into one image. Emphasize color palette harmony, styling cues, and a “trend board” vibe."},
      {"name": "film photography aesthetic", "description": "Analog film look: natural grain, softer contrast, subtle color shifts, and slight imperfections. Emphasize 35mm feel, gentle highlights, and nostalgic tone."},
      {"name": "polaroid snapshot", "description": "Instant-camera vibe: soft focus, slight overexposure, warm tint, and a casual candid composition. Emphasize the instant-photo feel and simple framing."},
      {"name": "disposable camera aesthetic", "description": "Flash-forward, candid look with harsh on-camera flash, grain, and casual framing. Emphasize candid realism and imperfect exposure."},
      {"name": "90s magazine scan", "description": "Retro print look with slight halftone, paper texture, and scanned artifacts. Emphasize 1990s editorial vibes and subtle print imperfections."},
      {"name": "y2k digital aesthetic", "description": "Early-2000s pop-digital vibe: glossy highlights, playful accessories, vibrant colors, and nostalgic tech-era styling. Emphasize shiny textures and Y2K fashion cues."},
      {"name": "vaporwave art", "description": "Retro-futuristic neon palette with 80s/90s nostalgia, gradients, and surreal digital motifs. Emphasize pink/teal tones, grid sunsets, and dreamy synth vibes."},
      {"name": "lofi aesthetic", "description": "Soft, cozy, low-contrast vibe with muted colors and calm mood. Emphasize warm interiors, gentle lighting, and relaxed composition."},
      {"name": "dark academia portrait", "description": "Moody scholarly aesthetic: vintage clothing, libraries, candles, and warm low light. Emphasize old books, tweed/linen textures, and a contemplative atmosphere."},
      {"name": "cottagecore scene", "description": "Pastoral, handmade, nature-forward vibe: soft light, flowers, linen fabrics, and rustic interiors. Emphasize warmth, simplicity, and natural textures."},
      {"name": "ethereal fantasy", "description": "Dreamy, otherworldly vibe with soft glow, mist, delicate textures, and magical atmosphere. Emphasize light bloom, airy fabrics, and gentle color palettes."},
      {"name": "renaissance painting", "description": "Classical fine-art look with balanced composition, soft chiaroscuro, and period clothing cues. Emphasize painted texture, muted pigments, and museum-quality framing."},
      {"name": "baroque portrait", "description": "Dramatic classical painting style with deep shadows, rich fabrics, ornate details, and strong directional light. Emphasize theatrical mood and luxurious textures."},
      {"name": "ukiyo-e style", "description": "Traditional Japanese woodblock-print aesthetic: flat color areas, stylized linework, patterned fabrics, and decorative composition. Emphasize print texture and classic motifs."},
      {"name": "art deco illustration", "description": "Geometric, elegant poster style with sharp shapes, metallic accents, and symmetrical composition. Emphasize sleek luxury and 1920s–1930s design cues."},
      {"name": "soviet poster art", "description": "Bold propaganda-poster visual language: limited palette, strong shapes, dynamic angles, and heroic composition (without real slogans). Emphasize graphic design and dramatic perspective."},
      {"name": "pulp fiction cover", "description": "Retro paperback cover illustration with exaggerated drama, bold title-space framing (but do not include actual text), and high-contrast lighting. Emphasize noir/pulp mood and dynamic staging."},
      {"name": "noir detective scene", "description": "Classic film-noir mood: high-contrast shadows, smoke/fog, dramatic backlight, and tense storytelling. Emphasize trench coats, street lamps, and moody urban settings."},
      {"name": "retro sci-fi illustration", "description": "Vintage sci-fi cover art vibe with optimistic futurism, bold shapes, and mid-century design language. Emphasize retro tech, rayguns/space motifs, and stylized colors."}
    ],
    "nsfw": [
      {"name": "erotic art piece", "description": "Adult-themed artwork with sensual mood. Keep it non-graphic and tasteful; never depict minors; avoid explicit sex acts."},
      {"name": "fine art nude photography", "description": "Adult-only fine art nude photography. Keep it non-graphic and tasteful; never depict minors; avoid explicit sex acts or pornographic framing."},
      {"name": "hentai", "description": "Adult-only anime-style erotic artwork. Keep language non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "ecchi", "description": "Adult-only suggestive anime-style artwork with playful eroticism. Keep language non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "adult vtuber model", "description": "Adult-only stylized streamer-avatar character design (often anime-inspired) with polished, clean rendering. Emphasize character readability, signature outfit, and a modern online persona vibe. Keep it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "nsfw 3D character render", "description": "Adult-only CGI/3D-rendered character with physically plausible materials, studio or scene lighting, and a rendered look. Mention subsurface scattering, glossy fabric, or game/film-quality rendering cues. Keep it non-graphic; never depict minors; avoid  explicit sex acts."},
      {"name": "adult game character art", "description": "Adult-only character key art suitable for a game: dynamic pose, clear silhouette, gear details, and thematic world cues. Often high-contrast, dramatic lighting, and action-ready styling. Keep it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "pin-up art", "description": "Retro-inspired illustration or poster-style character art with vintage glamour and playful pose. Keep it tasteful and non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "dark feminine glamour", "description": "Stylized beauty/fashion portrait emphasizing elegance, polish, and flattering lighting with a mysterious, edgy vibe. Think magazine glamour: smooth light, confident pose, refined styling, and a luxurious vibe. Keep it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "boudoir glamour", "description": "Stylized intimate portrait emphasizing mood, lighting, and tasteful sensual styling. Think magazine glamour: smooth light, confident pose, refined styling, and a luxurious vibe. Keep it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "fetish fashion", "description": "Edgy fashion imagery with fetish-inspired styling (e.g., latex, leather, corsets) presented in a tasteful, art-directed manner. Emphasize confident poses, dramatic lighting, and high-fashion vibes while keeping it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "erotic fantasy illustration", "description": "Illustrated fantasy scene/character with magical and sensual elements, ornate materials, and mythic atmosphere. Use stylized lighting and storybook or epic fantasy cues while keeping it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "sci-fi pin-up art", "description": "Futuristic retro-inspired illustration or poster-style character art with sci-fi elements and playful pose. Keep it tasteful and non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "adult comic book art", "description": "Graphic novel-style illustration with mature themes presented in a non-graphic manner. Emphasize dynamic poses, bold linework, and storytelling while avoiding explicit sex acts and never depicting minors."},
      {"name": "erotic surrealism", "description": "Surrealist artwork with sensual themes presented in an abstract, non-literal manner. Emphasize dreamlike imagery, symbolic elements, and artistic expression while keeping it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "nsfw digital painting", "description": "Adult-only painterly artwork with visible brushwork/painted rendering rather than photographic realism. Emphasize stylization, color harmony, and artistic texture while keeping it non-graphic; never depict minors; avoid explicit sex acts."} ,
      {"name": "nsfw anime style", "description": "Adult-only stylized 2D anime illustration: simplified facial features, clean linework, flat-to-cel shading, and expressive eyes. Avoid describing camera gear or photographic realism. Keep language non-graphic; never depict minors; avoid explicit sex acts ."},
      {"name": "nsfw semi-real anime", "description": "Adult-only anime-inspired character with more realistic proportions and rendering. Softer shading, more detailed materials, but still clearly illustrated (not a photo). Keep language non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "nsfw instagram aesthetic", "description": "Adult-only highly curated lifestyle/fashion image with cohesive color grading and composition. Emphasize clean backgrounds, pleasing symmetry, and trendy styling while keeping it non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "nsfw tiktok content", "description": "Adult-only modern short-form creator vibe: energetic pose, casual setup, bold styling, and attention-grabbing framing. Emphasize contemporary youth culture styling while keeping it adult and non-graphic; never depict minors; avoid explicit sex acts."},
      {"name": "nsfw film photography aesthetic", "description": "Adult-only analog film look: natural grain, softer contrast, subtle color shifts, and slight imperfections. Emphasize 35mm feel, gentle highlights, and nostalgic tone while keeping it non-graphic; never depict minors; avoid explicit sex acts."}
    ]
  },
  "gender": [
    "female",
    "male",
    "non-binary"
  ],
  "race": [
    "african diaspora",
    "east asian",
    "south asian",
    "southeast asian",
    "central asian",
    "middle eastern",
    "latinx",
    "indigenous americas",
    "pacific islander",
    "mixed heritage",
    "caucasian european"
  ],
  "age_group": [
    "young adult",
    "mid twenties",
    "early thirties",
    "late thirties",
    "early forties",
    "late forties",
    "middle-aged"
  ],
  "body_type": [
    "slim",
    "athletic",
    "curvy",
    "muscular",
    "petite",
    "broad shouldered",
    "plus size",
    "hourglass",
    "pear shaped",
    "rectangle",
    "tall",
    "stocky"
  ],
  "hair_color": [
    "jet black",
    "soft black",
    "dark brown",
    "chocolate brown",
    "chestnut brown",
    "caramel brown",
    "honey blonde",
    "golden blonde",
    "platinum blonde",
    "strawberry blonde",
    "copper red",
    "burgundy red",
    "auburn",
    "ginger",
    "silver",
    "salt and pepper",
    "white",
    "pastel pink",
    "hot pink",
    "pastel purple",
    "deep violet",
    "electric blue",
    "teal",
    "mint green",
    "forest green",
    "peach",
    "coral",
    "rose gold",
    "money piece highlights",
    "face framing highlights",
    "balayage ombre",
    "split dye two-tone",
    "rainbow gradient",
    "underlights hidden color"
  ],
  "hair_style": [
    "bob",
    "long bob",
    "pixie cut",
    "mullet",
    "ponytail",
    "high ponytail",
    "single braid",
    "double braids",
    "bun",
    "top knot",
    "half up half down",
    "wavy hair",
    "curly hair",
    "straight hair",
    "afro",
    "dreadlocks",
    "updo",
    "pigtails",
    "twists",
    "cornrows",
    "layered cut",
    "bangs",
    "side part",
    "wolf cut",
    "hime cut",
    "butterfly cut",
    "jellyfish cut",
    "curtain bangs",
    "space buns",
    "shag cut",
    "buzz cut with design"
  ],
  "eye_color": [
    "dark brown",
    "warm brown",
    "hazel",
    "amber",
    "honey gold",
    "forest green",
    "emerald green",
    "sage green",
    "icy blue",
    "ocean blue",
    "steel gray",
    "stormy gray",
    "violet",
    "heterochromia",
    "cat eye gold",
    "silver metallic"
  ],
  "facial_expression": [
    "neutral expression",
    "soft smile",
    "genuine smile with teeth",
    "closed-lip smile",
    "serious focus",
    "playful wink",
    "sultry gaze",
    "confident smirk",
    "intense stare",
    "surprised",
    "thoughtful",
    "mischievous grin",
    "wistful melancholy",
    "mid-laugh candid",
    "determined",
    "dreamy distant gaze",
    "knowing smile",
    "fierce scowl",
    "subtle pout",
    "serene peace",
    "curious wonder",
    "coy glance"
  ],
  "face_angle": [
    "front view",
    "three quarter left",
    "three quarter right",
    "profile left",
    "profile right",
    "looking upward",
    "looking downward",
    "over shoulder left",
    "over shoulder right",
    "tilted upward glance",
    "tilted downward glance",
    "dutch tilt focus"
  ],
  "camera_angle": [
    "eye level portrait",
    "slight high angle",
    "slight low angle",
    "dramatic low angle",
    "top down",
    "dutch tilt",
    "close up portrait",
    "medium shot",
    "wide establishing shot",
    "overhead spotlight shot",
    "tracking side angle",
    "cinematic backlight frame",
    "fisheye distortion",
    "drone shot",
    "selfie angle"
  ],
  "pose_style": {
    "sfw": [
      "standing three-quarter view, weight on one leg, one hand on hip, relaxed gaze",
      "standing straight, feet together, arms at sides, confident direct gaze",
      "contrapposto classical, hip shifted, shoulders relaxed, timeless elegance",
      "hand on hip, torso twisted toward camera, knowing smile",
      "over-shoulder glance, body turned away, mysterious allure",
      "seated elegantly, legs crossed, hands in lap, poised expression",
      "leaning against wall, one knee bent, casual cool attitude",
      "arms overhead stretch, torso elongated, carefree energy",
      "mid-twirl, fabric flowing, joyful movement captured",
      "low crouch dynamic, one knee forward, intense focus",
      "hair flip motion, playful energy, wind-swept effect",
      "arms crossed confident, power stance, direct eye contact",
      "hand framing face, fingertips near jaw, soft intimate gaze",
      "runway walk, elongated stride, editorial confidence",
      "editorial lean, chin lifted, effortless sophistication",
      "relaxed slouch, hands in pockets, off-duty model vibes",
      "hand to collarbone, vulnerable elegance, gentle expression",
      "reclining on sofa, one elbow propped, languid grace",
      "mirror selfie, phone at waist, head tilt, candid charm",
      "candid laugh, head thrown back, genuine joy",
      "model off-duty, coffee in hand, oversized sunglasses, unbothered",
      "quiet luxury seated, minimal movement, serene composure",
      "ballet-inspired, pointed toe, arms curved gracefully",
      "power stance wide, commanding presence, boss energy",
      "wind-blown editorial, dramatic fabric motion, fierce expression",
      "golden hour silhouette, backlit profile, contemplative mood",
      "lying in nature, arms spread, dreamy connection",
      "reading cozy, book in hands, peaceful focus",
      "fitness pause, hand on hip, athletic determination",
      "vintage film candid, looking away, nostalgic moment",
      "rooftop cityscape, leaning on ledge, urban dreamer",
      "old money poised, understated elegance, neutral sophistication",
      "coquette feminine, head tilt, hands near face, flirty charm",
      "main character walk, coat flowing, confident stride",
      "clean girl minimal, effortless beauty, natural confidence",
      "mob wife glamour, fur draped, oversized glasses, untouchable",
      "it girl strut, blazer on shoulders, commanding presence",
      "dark feminine, all black, mysterious power stance",
      "tenniscore action, mid-serve freeze, athletic grace",
      "coastal grandmother, linen flowing, serene seaside",
      "cafe window, chin on palm, people watching dreamy",
      "gallery opening, champagne held elegantly, cultured ease",
      "hot girl walk, purposeful stride, self-improvement energy",
      "getting ready, mid-makeup, mirror reflection, anticipation",
      "70s disco pose, hand on hip, dramatic head turn",
      "90s supermodel, fierce walk, shoulder-first stride",
      "y2k paris hilton, peace sign, playful pout",
      "myspace angle, camera held high, emo tilt"
    ],
    "nsfw": [
      "lying on back, relaxed, hands behind head, soft gaze",
      "lying on back, knees bent, arms at sides, intimate expression",
      "lying on back, one knee raised, hand resting on knee, inviting gaze",
      "lying on back, arms reaching overhead, elongated stretch",
      "lying on back, sheets loosely draped, dreamy expression",
      "lying on side, head propped on hand, languid pose",
      "lying on side, knees drawn up, embracing pillow, sleepy softness",
      "lying on stomach, chin on folded arms, playful glance back",
      "lying on stomach, twisted toward camera, teasing expression",
      "reclining on elbows, upper body raised, confident gaze",
      "seated on floor, legs extended, leaning back on hands",
      "seated cross-legged, spine arched, hands on thighs",
      "kneeling upright, hands on thighs, composed elegance",
      "kneeling with one knee up, casual intimate pose",
      "kneeling sitting back on heels, demure downward gaze",
      "back against headboard, arms overhead, eyes closed bliss",
      "bathtub relaxed, bubbles covering, serene luxury",
      "silk sheets tangled, morning after aesthetic, soft awakening",
      "window light silhouette, sheer fabric, artistic shadow play",
      "vanity mirror reflection, getting ready, intimate moment"
    ]
  },
  "makeup_style": [
    {"name": "no makeup natural", "description": "Barely-there makeup: natural skin texture, minimal product, subtle grooming, understated finish."},
    {"name": "bare minimum tinted moisturizer", "description": "Very light base with sheer coverage; natural brows and lashes; fresh, simple look."},
    {"name": "clean girl effortless", "description": "Minimal, polished makeup: groomed brows, subtle blush, glossy lips, dewy skin."},
    {"name": "soft glam everyday", "description": "Wearable glam: soft eyeshadow, defined lashes, gentle contour, flattering natural tones."},
    {"name": "natural beauty enhanced", "description": "Enhancement-focused: even complexion, subtle highlight, light definition without dramatic colors."},
    {"name": "fresh faced dewy", "description": "Hydrated glow: luminous skin, minimal powder, soft blush, glossy lip, light eye definition."},
    {"name": "sun-kissed healthy glow", "description": "Bronzed warmth: soft bronzer, warm blush, subtle shimmer highlight, natural glossy lips."},
    {"name": "glass skin luminous", "description": "Ultra-luminous, smooth skin look: bright highlight, dewy finish, minimal texture emphasis."},
    {"name": "matte flawless finish", "description": "Full-coverage matte base, smooth finish, crisp definition, minimal shine, polished look."},
    {"name": "romantic soft pink", "description": "Pink-forward palette: rosy blush, soft pink lids, gentle lip tint, delicate romantic vibe."},
    {"name": "warm bronzed goddess", "description": "Warm glam: bronze eyeshadow, golden highlight, strong bronzer, sunlit glow."},
    {"name": "cool toned sculpted", "description": "Cool contouring: taupe/gray-brown shadows, sculpted cheeks, crisp highlight, refined finish."},
    {"name": "old hollywood glamour", "description": "Classic vintage glam: red lipstick, defined liner, softly contoured cheeks, elegant polish."},
    {"name": "90s supermodel matte", "description": "90s runway vibe: matte base, brown liner, neutral lips, subtle smoky eye, strong cheekbones."},
    {"name": "90s brown tones", "description": "Brown lip liner + neutral brown shadows, warm contour, understated 90s aesthetic."},
    {"name": "80s bold colorful", "description": "Bold 80s colors: bright eyeshadow, strong blush, vivid lips, high-contrast playful glam."},
    {"name": "70s disco shimmer", "description": "Shimmery lids, glossy highlight, warm tones, dramatic lashes; retro disco sparkle."},
    {"name": "60s mod dramatic", "description": "Mod makeup: graphic liner, bold lashes, pale lip, clean shapes, high-contrast eyes."},
    {"name": "50s pinup classic", "description": "Pinup: winged eyeliner, red or rosy lips, smooth base, classic feminine polish."},
    {"name": "korean soft gradient", "description": "K-beauty gradient lips, soft blush, straight brows, subtle shimmer, youthful gentle look."},
    {"name": "japanese natural flush", "description": "Soft, natural blush and subtle eye makeup; fresh understated J-beauty style."},
    {"name": "chinese douyin glam", "description": "Douyin-inspired: bright under-eye highlight, glossy lips, sparkly eyes, cute high-impact glam."},
    {"name": "latte warm neutral", "description": "Warm neutral browns: creamy beige-brown palette, soft contour, glossy neutral lips."},
    {"name": "strawberry pink fresh", "description": "Fresh pink blush and lips with dewy skin; cute rosy look."},
    {"name": "peach coral sunny", "description": "Peach/coral tones on cheeks and lips; warm, sunny, lively makeup."},
    {"name": "berry rich deep", "description": "Berry lip tones with complementary blush; richer saturated palette."},
    {"name": "plum sultry dark", "description": "Plum/burgundy tones, deeper eyeshadow, sultry dramatic mood."},
    {"name": "nude understated", "description": "Neutral nude lips and soft definition; minimal color, clean and understated."},
    {"name": "mob wife dramatic glam", "description": "High-glam statement: sharp liner, heavy lashes, bold lip, intense contour and highlight."},
    {"name": "coquette soft feminine", "description": "Soft blush, delicate liner, glossy lips, sweet romantic details."},
    {"name": "dark feminine mysterious", "description": "Smokier eyes, deeper lip tones, sharp definition; confident and mysterious vibe."},
    {"name": "gothic pale dramatic", "description": "Pale base, dark lipstick, heavy liner, high contrast; gothic drama."},
    {"name": "grunge smudged undone", "description": "Smudged eyeliner, messy shadow, muted lips; intentionally imperfect grunge look."},
    {"name": "punk bold graphic", "description": "Graphic eyeliner, bold shapes/colors, high contrast; edgy punk aesthetic."},
    {"name": "ethereal fairy light", "description": "Soft shimmer highlight, pastel tones, delicate sparkle; airy magical glow."},
    {"name": "editorial avant-garde", "description": "High-fashion experimental makeup: unusual shapes/colors, bold styling, runway/editorial vibe."},
    {"name": "euphoria artistic", "description": "Creative, artful makeup with gems/glitter accents and bold color placements."},
    {"name": "festival glitter bold", "description": "Bright colors, glitter, face gems; energetic festival-ready styling."},
    {"name": "bridal radiant classic", "description": "Timeless bridal glam: radiant base, soft smoky eyes, defined lashes, natural rosy lips."},
    {"name": "red carpet polished", "description": "Professional event glam: flawless base, defined eyes, sculpted cheeks, high-end finish."}
  ],
  "fashion_outfit": [
    {"name": "mini skirt and crop top", "description": "Youthful two-piece look: short skirt with fitted crop top; trendy casual styling."},
    {"name": "tube dress", "description": "Strapless fitted dress emphasizing clean neckline and body-hugging silhouette."},
    {"name": "bodycon dress", "description": "Tight, figure-hugging dress with sleek silhouette and confident evening vibe."},
    {"name": "slip dress", "description": "Satin-like slip dress with delicate straps, soft drape, minimalist elegance."},
    {"name": "midi dress", "description": "Mid-calf dress length; balanced, versatile silhouette suitable for daytime or chic events."},
    {"name": "maxi dress flowy", "description": "Full-length flowing dress with soft movement and airy fabric drape."},
    {"name": "wrap dress", "description": "Wrap-front dress with tied waist and flattering V-neck; classic feminine shape."},
    {"name": "shirt dress", "description": "Button-up shirt styled as a dress; structured casual chic with belt options."},
    {"name": "sweater dress", "description": "Knitted dress for cozy styling; warm texture and soft silhouette."},
    {"name": "evening gown", "description": "Formal full-length gown for events; elegant fabrics and refined details."},
    {"name": "mermaid gown", "description": "Fitted gown flaring at knees; dramatic red-carpet silhouette."},
    {"name": "ball gown", "description": "Voluminous skirt with fitted bodice; fairytale formal look."},
    {"name": "cocktail dress", "description": "Dressy shorter formal dress for parties; polished and stylish."},
    {"name": "little black dress", "description": "Classic LBD: simple black cocktail dress; timeless, versatile elegance."},
    {"name": "corset top with trousers", "description": "Structured corset-like top paired with tailored trousers; chic contrast of fitted + sleek."},
    {"name": "corset and maxi skirt", "description": "Corset bodice with flowing long skirt; romantic structured-meets-airy silhouette."},
    {"name": "bustier and wide leg pants", "description": "Fitted bustier with wide-leg pants; modern evening fashion look."},
    {"name": "matching set co-ord", "description": "Coordinated top and bottom set in matching fabric/print; put-together styling."},
    {"name": "power suit tailored", "description": "Sharp tailored suit for strong silhouette; blazer + matching trousers."},
    {"name": "oversized blazer dress", "description": "Oversized blazer worn as a dress; bold fashion-forward silhouette."},
    {"name": "leather pants and silk top", "description": "Edgy leather pants paired with soft silky blouse; texture contrast."},
    {"name": "wide leg trousers and blouse", "description": "Loose wide-leg trousers with blouse; elegant modern daywear."},
    {"name": "cargo pants and tank top", "description": "Utility cargo pants with simple tank; casual streetwear functional vibe."},
    {"name": "baggy jeans and baby tee", "description": "Loose jeans paired with fitted baby tee; youthful Y2K casual styling."},
    {"name": "low rise jeans and cropped top", "description": "Low-rise denim with cropped top; early-2000s inspired silhouette."},
    {"name": "mom jeans and cardigan", "description": "High-waist relaxed jeans with cozy cardigan; casual vintage comfort."},
    {"name": "denim on denim", "description": "Double-denim outfit; coordinated jeans + denim jacket/shirt."},
    {"name": "leather jacket outfit", "description": "Leather jacket as key outerwear; rebellious edge layered over casual basics."},
    {"name": "bomber jacket streetwear", "description": "Bomber jacket with streetwear layers; sporty urban styling."},
    {"name": "varsity jacket preppy", "description": "Letterman/varsity jacket; collegiate sporty-prep vibe."},
    {"name": "trench coat classic", "description": "Classic trench coat layering; structured timeless outerwear."},
    {"name": "teddy coat cozy", "description": "Plush teddy coat; warm fuzzy texture and winter cozy style."},
    {"name": "puffer jacket winter", "description": "Quilted puffer jacket; practical winter outerwear with sporty volume."},
    {"name": "hoodie and sweatpants", "description": "Matching casual loungewear; relaxed comfy athleisure vibe."},
    {"name": "matching tracksuit", "description": "Coordinated sporty set; zip jacket + pants with athletic styling."},
    {"name": "yoga set athleisure", "description": "Sport bra + leggings set; fitness-focused, sleek athleisure silhouette."},
    {"name": "tennis skirt outfit", "description": "Pleated tennis skirt with sporty top; clean athletic-preppy styling."},
    {"name": "bike shorts and oversized tee", "description": "Fitted bike shorts with oversized t-shirt; modern casual street-athleisure."},
    {"name": "swimsuit one piece", "description": "One-piece swimwear; streamlined beach/pool silhouette."},
    {"name": "bikini set", "description": "Two-piece swimwear; beach-ready styling (adult, SFW framing)."},
    {"name": "lingerie set", "description": "Adult-only intimate outfit; keep framing tasteful and non-graphic if used."},
    {"name": "silk pajama set", "description": "Silky pajama two-piece; luxurious loungewear vibe."},
    {"name": "saree traditional", "description": "Traditional saree drape; elegant cultural garment with rich fabric and pleats."},
    {"name": "lehenga bridal", "description": "Lehenga-style formal outfit; ornate embroidery and ceremonial styling."},
    {"name": "salwar kameez", "description": "Traditional tunic + pants set; graceful comfortable cultural attire."},
    {"name": "cheongsam qipao", "description": "Fitted traditional dress with high collar and elegant tailoring."},
    {"name": "hanfu traditional", "description": "Flowing Hanfu robes; layered traditional silhouettes and elegant fabric movement."},
    {"name": "kimono formal", "description": "Formal kimono styling; structured layers, obi belt, refined traditional look."},
    {"name": "yukata casual", "description": "Casual summer kimono; lighter fabric and relaxed festival vibe."},
    {"name": "hanbok korean", "description": "Traditional Hanbok silhouette; high-waist skirt and colorful layered garments."},
    {"name": "modern abaya", "description": "Modern abaya with contemporary tailoring; modest flowing outer garment."},
    {"name": "kaftan flowing", "description": "Loose flowing kaftan; relaxed airy silhouette and drapey fabric."},
    {"name": "dashiki colorful", "description": "Colorful patterned dashiki-inspired garment; bold textiles and cultural styling."},
    {"name": "dirndl bavarian", "description": "Traditional Bavarian dirndl; bodice + skirt + apron styling."},
    {"name": "flamenco dress", "description": "Flamenco-inspired dress with ruffles; dramatic movement and bold Spanish flair."},
    {"name": "nurse uniform", "description": "Uniform-inspired outfit; keep non-fetish, SFW context."},
    {"name": "flight attendant uniform", "description": "Professional uniform styling; tailored, neat, airline-inspired look."},
    {"name": "maid uniform", "description": "Costume/uniform styling; keep SFW and non-fetish framing."},
    {"name": "schoolgirl uniform", "description": "Uniform styling; ensure adult-coded character (young adult) and SFW framing."},
    {"name": "cheerleader uniform", "description": "Sport uniform with pleated skirt and team vibe; SFW framing."},
    {"name": "military dress uniform", "description": "Formal military-style dress uniform; structured, decorated, ceremonial look."},
    {"name": "astronaut suit", "description": "Space suit with helmet/gear; sci-fi technical outfit silhouette."},
    {"name": "racing suit", "description": "Motorsport racing suit; fitted utility suit with sporty detailing."}
  ],
  "fashion_style": [
    {"name": "high fashion editorial", "description": "Avant-garde, magazine/editorial styling with bold silhouettes, dramatic posing, and art-directed composition."},
    {"name": "couture runway", "description": "Runway/catwalk couture: statement garments, luxurious fabrics, and show lighting; outfit is the centerpiece."},
    {"name": "minimalist clean", "description": "Simple, refined wardrobe with clean lines, neutral palette, minimal accessories, and uncluttered styling."},
    {"name": "maximalist bold", "description": "Loud, layered, pattern-mixed styling with strong color, statement accessories, and high visual density."},
    {"name": "boho free spirit", "description": "Relaxed bohemian styling: flowing fabrics, earthy tones, fringes, embroidery, and eclectic accessories."},
    {"name": "romantic feminine", "description": "Soft, elegant styling with delicate fabrics, lace/satin cues, flattering silhouettes, and gentle color palettes."},
    {"name": "cottagecore pastoral", "description": "Pastoral, handmade vibe: linen/cotton, floral prints, pinafore dresses, and soft natural textures."},
    {"name": "dark academia scholarly", "description": "Vintage scholarly look: tweed, turtlenecks, wool coats, muted tones, and library-ready refinement."},
    {"name": "light academia soft", "description": "Warm, airy academia: creams/beiges, cardigans, pleats, soft tailoring, and optimistic vintage cues."},
    {"name": "preppy classic", "description": "Clean, collegiate styling: polos, blazers, pleats, loafers, and crisp well-groomed silhouettes."},
    {"name": "old money understated", "description": "Heritage luxury without logos: tailored basics, cashmere/wool, muted palette, and impeccable fit."},
    {"name": "quiet luxury", "description": "Premium minimalism: subtle high-quality materials, restrained accessories, and elegant simplicity."},
    {"name": "mob wife glamour", "description": "Opulent, bold glam: faux fur/leather, gold jewelry, dramatic makeup, and high-status attitude."},
    {"name": "clean girl aesthetic", "description": "Fresh, minimal styling: neutral basics, sleek hair, dewy makeup, and effortless polished simplicity."},
    {"name": "coquette feminine", "description": "Sweet, flirty feminine styling: bows, ribbons, soft pinks, delicate details, and playful romance."},
    {"name": "balletcore graceful", "description": "Ballet-inspired fashion: wrap tops, tights, soft knits, delicate shoes, and poised elegant lines."},
    {"name": "tenniscore sporty", "description": "Tennis/prep athletic styling: pleated skirts, polos, clean whites, and sporty refined accessories."},
    {"name": "coastal grandmother", "description": "Relaxed seaside elegance: linen sets, cardigans, neutrals, straw accessories, and calm upscale comfort."},
    {"name": "tomato girl mediterranean", "description": "Sunny Mediterranean summer styling: breezy dresses, red accents, baskets, and coastal market energy."},
    {"name": "streetwear urban", "description": "Modern streetwear: hoodies, sneakers, graphic layers, oversized fits, and city-casual attitude."},
    {"name": "gorpcore outdoor", "description": "Technical outdoor fashion: hiking shells, utility pockets, trail shoes, and practical performance layering."},
    {"name": "techwear functional", "description": "Futuristic utility styling: black/gray palette, straps, modular pockets, sleek performance fabrics."},
    {"name": "normcore basic", "description": "Intentionally plain everyday basics: simple tees, jeans, neutral layers, and low-key accessories."},
    {"name": "blokecore casual", "description": "Football/sports-casual vibe: jerseys, track jackets, relaxed denim, and pub-ready street casual."},
    {"name": "skater punk", "description": "Skate culture styling: baggy tees, hoodies, loose pants, sneakers, and gritty youthful edge."},
    {"name": "grunge layered", "description": "90s grunge layering: flannel, distressed denim, band-tee vibe, muted tones, and messy texture."},
    {"name": "gothic romantic", "description": "Dark, elegant gothic styling: lace/velvet, dramatic silhouettes, ornate details, and moody refinement."},
    {"name": "cyber goth", "description": "Industrial cyber-goth: black base with neon accents, straps, platform boots, and club-tech attitude."},
    {"name": "e-girl aesthetic", "description": "Internet alt styling: contrast colors, playful accessories, layered tops, and trendy edgy makeup cues."},
    {"name": "soft girl pastel", "description": "Cute pastel styling: soft colors, cozy knits, gentle silhouettes, and sweet youthful accessories."},
    {"name": "dark feminine", "description": "Confident, moody elegance: black-forward palette, sharp silhouettes, and a powerful feminine vibe."},
    {"name": "kawaii cute", "description": "Japanese cute styling: bright accents, adorable motifs, playful accessories, and cheerful proportions."},
    {"name": "gyaru japanese", "description": "Bold Japanese gyaru fashion: glam makeup, flashy outfits, tan/gloss cues, and confident party vibe."},
    {"name": "lolita victorian", "description": "Lolita-inspired Victorian doll fashion: frills, lace, petticoats, and ornate modest silhouettes."},
    {"name": "y2k nostalgic", "description": "Early-2000s vibe: low-rise silhouettes, glossy materials, baby tees, and playful pop accessories."},
    {"name": "mcbling sparkly", "description": "2000s bling-glam: rhinestones, metallics, velour, flashy jewelry, and high-shine styling."},
    {"name": "indie sleaze", "description": "Messy-cool party fashion: leather jackets, smudged makeup, flash-photo vibe, and 2000s club edge."},
    {"name": "90s supermodel", "description": "90s model-off-duty and runway glamour: sleek silhouettes, minimal makeup, and confident chic."},
    {"name": "80s power dressing", "description": "Strong 80s tailoring: shoulder pads, bold colors, statement belts, and executive confidence."},
    {"name": "70s bohemian", "description": "70s boho: wide-leg pants, earthy prints, suede/fringe cues, and warm retro palettes."},
    {"name": "60s mod", "description": "60s mod styling: geometric shapes, mini dresses, bold color blocks, and clean graphic lines."},
    {"name": "50s rockabilly", "description": "50s rockabilly/pinup fashion: polka dots, high-waist silhouettes, bandanas, and retro charm."},
    {"name": "40s wartime elegance", "description": "1940s tailored practicality: structured dresses/suits, modest lines, and classic period details."},
    {"name": "roaring 20s flapper", "description": "1920s flapper glamour: fringe, beading, art deco cues, feather accessories, and party elegance."},
    {"name": "victorian gothic", "description": "Victorian-inspired dark couture: corsetry cues, high collars, lace, and dramatic antique silhouettes."},
    {"name": "regencycore bridgerton", "description": "Regency-era romantic fashion: empire waists, gloves, soft pastels, and period elegance."},
    {"name": "cyberpunk neon", "description": "Neon cyberpunk street style: techwear, chrome accents, bold lighting, and futuristic urban edge."},
    {"name": "solarpunk eco", "description": "Optimistic eco-future styling: light fabrics, natural colors, plant motifs, and sustainable tech cues."},
    {"name": "steampunk industrial", "description": "Steampunk fashion: leather, brass, goggles, corsetry/tailcoats, and Victorian-meets-machinery details."},
    {"name": "retro futurism", "description": "Mid-century retro-future: clean shapes, optimistic sci-fi cues, glossy plastics, and space-age styling."},
    {"name": "vaporwave aesthetic", "description": "Vaporwave fashion vibe: neon/pastel gradients, 80s/90s nostalgia, and playful surreal pop styling."},
    {"name": "festival bohemian", "description": "Festival-ready boho: layered jewelry, crochet/fringe, bold patterns, and carefree outdoor styling."},
    {"name": "athleisure sporty", "description": "Sport-meets-street: leggings, performance sets, sneakers, and functional comfortable silhouettes."},
    {"name": "resort vacation", "description": "Resort wear: breezy fabrics, sunglasses, swim coverups, and relaxed luxury holiday styling."},
    {"name": "après ski", "description": "After-ski luxury: puffer jackets, knit layers, fur-trim cues, snow boots, and cozy alpine glam."},
    {"name": "western cowgirl", "description": "Western/cowgirl fashion: denim, boots, belts, fringe, hats, and rustic Americana attitude."},
    {"name": "biker rebel", "description": "Biker style: leather jacket, boots, dark palette, metal hardware, and tough rebellious edge."}
  ],
  "footwear_style": [
    "barefoot",
    "classic pumps",
    "stiletto heels",
    "platform heels",
    "kitten heels",
    "block heels",
    "slingback heels",
    "strappy sandal heels",
    "mules heeled",
    "ankle boots",
    "knee high boots",
    "thigh-high boots",
    "combat boots chunky",
    "cowboy boots western",
    "chelsea boots",
    "doc martens style",
    "ugg boots cozy",
    "ballet flats",
    "mary janes",
    "loafers chunky",
    "penny loafers",
    "oxfords",
    "brogues",
    "white sneakers classic",
    "chunky sneakers dad shoes",
    "platform sneakers",
    "converse high tops",
    "running shoes athletic",
    "slides casual",
    "flip flops",
    "birkenstock sandals",
    "gladiator sandals",
    "espadrilles",
    "clogs wooden",
    "clear heels",
    "jelly shoes nostalgic",
    "mesh flats ballet"
  ],
  "upcycled_materials": [
    "upcycled denim",
    "reclaimed silk",
    "deadstock fabric",
    "vintage lace",
    "parachute nylon",
    "sailcloth",
    "seatbelt weave",
    "recycled plastic fiber",
    "fishing net mesh",
    "rubber tire",
    "quilted blanket",
    "circuit board",
    "reclaimed tartan",
    "newspaper pleats",
    "felted sweater"
  ],
  "background_style": {
    "studio_controlled": [
      "white seamless backdrop",
      "black void backdrop",
      "gray neutral backdrop",
      "colored gel lighting backdrop",
      "gradient ombre backdrop",
      "studio cyclorama infinity",
      "brick wall industrial",
      "concrete brutalist wall",
      "marble luxury wall",
      "wood panel warm",
      "neon sign wall",
      "led screen wall",
      "mirror wall reflective",
      "velvet curtain dramatic",
      "silk fabric flowing",
      "bokeh fairy lights",
      "city lights bokeh night",
      "street art mural colorful",
      "graffiti urban wall",
      "vintage floral wallpaper",
      "geometric pattern wall",
      "terrazzo modern",
      "limewash textured",
      "ivy covered wall",
      "flower wall installation",
      "balloon wall party",
      "ring light setup",
      "softbox professional",
      "window natural light",
      "greenhouse glass"
    ],
    "public_exotic_real": [
      "paris cafe terrace",
      "italian piazza fountain",
      "santorini white buildings",
      "amalfi coast cliffside",
      "tokyo neon alley",
      "shibuya crossing rainy",
      "kyoto bamboo forest",
      "cherry blossom garden",
      "new york city street",
      "brooklyn bridge",
      "london red phone booth",
      "dubai skyline modern",
      "moroccan riad courtyard",
      "bali rice terraces",
      "maldives overwater",
      "swiss alps mountain",
      "lavender fields provence",
      "tulip fields holland",
      "northern lights aurora",
      "desert dunes golden hour",
      "tropical beach palm trees",
      "rooftop city view",
      "luxury hotel lobby",
      "grand staircase marble",
      "vintage library books",
      "museum gallery white",
      "concert venue backstage",
      "subway platform urban",
      "train station vintage",
      "airport terminal modern",
      "neon arcade retro",
      "diner booth 50s",
      "record store vinyl",
      "bookshop cozy",
      "flower market colorful",
      "farmers market rustic"
    ],
    "imaginative_surreal": [
      "galaxy nebula cosmic",
      "underwater fantasy",
      "enchanted forest magical",
      "crystal cave glowing",
      "floating islands sky",
      "neon cyberpunk cityscape",
      "vaporwave sunset grid",
      "dreamcore liminal space",
      "backrooms aesthetic",
      "heaven clouds ethereal",
      "hell flames dramatic",
      "mirror dimension infinite",
      "glitch digital corruption",
      "holographic iridescent",
      "bioluminescent forest",
      "aurora fantasy landscape",
      "cherry blossom dreamscape",
      "snow globe winter magic",
      "candy land fantasy",
      "gothic castle dark"
    ]
  },
  "lighting_style": [
    {"name": "soft daylight", "description": "Even, flattering daylight with soft shadows and natural color; gentle, realistic illumination."},
    {"name": "window light", "description": "Directional soft light from a window; natural falloff, gentle highlights, cozy interior feel."},
    {"name": "golden hour", "description": "Warm low-angle sunlight near sunset; soft glow, rim light, long shadows."},
    {"name": "blue hour", "description": "Cool twilight ambience; blue tones, soft contrast, calm evening mood."},
    {"name": "low key spotlight", "description": "Dark scene with focused key light; strong contrast, deep shadows, dramatic mood."},
    {"name": "high key studio", "description": "Bright, evenly lit studio look; minimal shadows, clean crisp exposure."},
    {"name": "gelled studio light", "description": "Studio lights with colored gels; stylized color casts and controlled highlights."},
    {"name": "rim lighting", "description": "Back/edge light outlining the subject; strong silhouette separation from background."},
    {"name": "neon lighting", "description": "Neon sources with vibrant colored light; strong color contrast and nightlife vibe."},
    {"name": "cinematic practical lights", "description": "Visible light sources in-scene (lamps, signs); cinematic mood with motivated lighting."},
    {"name": "mixed color temperature", "description": "Warm and cool lights together; contrasting tones (e.g., tungsten + daylight) for depth."},
    {"name": "hard sunlight", "description": "Direct harsh sun; sharp shadows, high contrast, strong highlights."},
    {"name": "volumetric lighting", "description": "Light beams visible through haze/fog/dust; atmospheric shafts and depth."},
    {"name": "rembrandt lighting", "description": "Classic portrait lighting with a triangular cheek highlight; painterly, sculpted face."},
    {"name": "split lighting", "description": "Face split half-lit, half-shadow; strong drama and definition."},
    {"name": "butterfly lighting", "description": "Key light above camera creating a small shadow under nose; flattering beauty portrait look."},
    {"name": "god rays", "description": "Strong radiant beams of light through clouds/trees/windows; ethereal dramatic effect."},
    {"name": "chiaroscuro", "description": "Extreme light/dark contrast; painterly dramatic shadows and highlights."},
    {"name": "bioluminescent glow", "description": "Self-illuminated glow from flora/fauna/objects; surreal luminous highlights in darkness."}
  ],
  "camera_lens": [
    {"name": "macro close-up", "description": "Extreme close focus for fine details; shallow depth of field and intimate framing."},
    {"name": "headshot", "description": "Tight framing on head and face; portrait emphasis with minimal body."},
    {"name": "shoulder-up portrait", "description": "Portrait framing from shoulders upward; classic portrait composition."},
    {"name": "waist-up shot", "description": "Medium portrait showing torso to waist; balance of face and outfit."},
    {"name": "three-quarter body", "description": "Framing shows subject from head to knees; good for outfit readability."},
    {"name": "full body", "description": "Full figure in frame from head to toe; emphasizes pose and outfit silhouette."},
    {"name": "environmental long shot", "description": "Wider composition showing subject within environment; strong sense of place."},
    {"name": "low angle", "description": "Camera below subject looking up; makes subject feel powerful/tall."},
    {"name": "high angle", "description": "Camera above subject looking down; can feel vulnerable, cute, or observational."},
    {"name": "top-down", "description": "Overhead view straight down; graphic composition and flattening perspective."},
    {"name": "wide angle", "description": "Wide field of view; more environment, potential perspective distortion near edges."},
    {"name": "telephoto", "description": "Long lens compression; flattering portrait background blur and reduced distortion."},
    {"name": "fish-eye", "description": "Ultra-wide fisheye distortion; curved lines and playful exaggerated perspective."},
    {"name": "dutch tilt", "description": "Tilted horizon; dynamic, uneasy, or edgy cinematic composition."},
    {"name": "over-the-shoulder", "description": "Shot from behind one shoulder; implies viewpoint and story context."},
    {"name": "anamorphic", "description": "Cinematic widescreen look with oval bokeh and horizontal flares; filmic vibe."},
    {"name": "tilt-shift", "description": "Selective focus plane; miniature effect or controlled focus; stylized perspective."},
    {"name": "35mm film", "description": "35mm film aesthetic: natural grain, gentle contrast, classic documentary feel."},
    {"name": "85mm portrait", "description": "Classic portrait focal length; flattering compression and creamy background blur."},
    {"name": "50mm prime", "description": "Natural perspective prime lens; versatile portrait with balanced field of view."}
  ],
  "color_palette": [
    {"name": "black and white classic", "description": "Monochrome palette; strong contrast and timeless photographic look."},
    {"name": "sepia vintage", "description": "Warm brown sepia tones; antique nostalgic feel."},
    {"name": "warm neutrals beige", "description": "Warm beige/cream neutrals; soft cozy minimal palette."},
    {"name": "cool neutrals gray", "description": "Cool grays and muted tones; modern, calm, subdued palette."},
    {"name": "soft pastels", "description": "Light pastel colors with low contrast; airy gentle mood."},
    {"name": "dusty rose pink", "description": "Muted rosy pinks; romantic, soft and modern."},
    {"name": "sage green natural", "description": "Muted sage greens; organic, calm, natural palette."},
    {"name": "butter yellow warm", "description": "Warm pale yellow accents; cheerful soft sunlight vibe."},
    {"name": "lavender dreamy", "description": "Lavender/purple haze; dreamy, delicate, ethereal palette."},
    {"name": "earth tones natural", "description": "Browns, olives, clay, sand; grounded outdoorsy palette."},
    {"name": "terracotta warm", "description": "Terracotta and warm clay tones; Mediterranean warmth."},
    {"name": "jewel tones rich", "description": "Saturated emerald/ruby/sapphire tones; luxurious rich color."},
    {"name": "teal and orange cinematic", "description": "Cinematic complementary grade: teal shadows + warm orange highlights."},
    {"name": "pink and blue vaporwave", "description": "Neon pinks and blues; retro synth/vaporwave vibe."},
    {"name": "red and black dramatic", "description": "High-contrast red/black palette; bold graphic drama."},
    {"name": "all white clean", "description": "Predominantly white palette; bright minimal clean aesthetic."},
    {"name": "all black moody", "description": "Black-dominant palette; dark, sleek, moody styling."},
    {"name": "golden hour warm", "description": "Warm sunlit grading; amber highlights and soft warmth."},
    {"name": "blue hour cool", "description": "Cool blue grading; twilight ambience and calm mood."},
    {"name": "sunset gradient", "description": "Gradient from warm to cool like a sunset sky; colorful atmospheric blend."},
    {"name": "neon cyberpunk", "description": "Neon magenta/cyan/green highlights with dark shadows; futuristic nightlife palette."},
    {"name": "chrome futuristic", "description": "Cool metallics and silvers; reflective sci-fi palette."},
    {"name": "90s kodak film", "description": "90s film color response: gentle grain, warm skin tones, slightly muted saturation."},
    {"name": "80s miami vice", "description": "80s neon pastel vibe: hot pinks, cyan, purple; flashy retro palette."},
    {"name": "70s burnt orange", "description": "70s earthy warm palette with burnt orange and browns; nostalgic warmth."},
    {"name": "60s pop art bold", "description": "Bold primary colors and high contrast; graphic pop-art energy."},
    {"name": "noir high contrast", "description": "Deep blacks and bright highlights; stark dramatic contrast."},
    {"name": "faded film vintage", "description": "Faded, low-saturation film look; nostalgic washed tones."},
    {"name": "cross processed", "description": "Cross-processed film look: shifted hues, punchy contrast, stylized color casts."},
    {"name": "technicolor saturated", "description": "Highly saturated classic cinema colors; vibrant bold multi-color palette."}
  ],
  "lora_trigger": {
    "demo": "char_demo",
    "alice": "char_alice"
  }
}
